;==============================================================================================
	include	hardware_profile.inc
	__config _CP_OFF & _WDT_OFF & _PWRTE_ON & _XT_OSC
;==============================================================================================
	include	MicroMenu_Lib.h
;==============================================================================================
Main_udata	udata_shr
w_temp		res	1
status_temp	res	1
offset		res	1						; Используется в макросе модификации PCL
;==============================================================================================
	if	USE_SHORT_MOD_PCL
known_zero	res	1						; Используется в укороченной версии макроса модификации PCL
	global	known_zero
	endif
;== Переменные ================================================================================
	global	offset
	extern	buttons
;== Подпрограммы, метки =======================================================================
	global	End_Interrupt_Heandler,Main
	extern	LCD_Line_Init,LCD_Init
	extern	Menu_heandler,Zastavka
;==============================================================================================
RESET_VECTOR	code	0h
	goto	Init
;==============================================================================================
ISR				code	4h				; Вектор прерывания
Interrupt_Heandler
	push								; Сохраним контекст
	Button_Heandler
End_Interrupt_Heandler
	pop									; Восстановим контекст	
	retfie
;==============================================================================================
Init
	CLR_RAM_macro						; Макрос очистки памяти. Требует коррекции диапазона под каждый конкретный МК (см. datasheet)
	banksel	OPTION_REG
	movlw	b'00000000'					; Enable pull-ups resistors on PortB
	movwf   OPTION_REG
	call	LCD_Line_Init				; Инициализация линий управления и шины данных для работы с дисплеем
	banksel TMR0
	MicroMenu_Init						; Инициализация MicroMenu	
	goto	Zastavka					; Выведем на экран заставку
Main
	Check_buttons_macro	
	goto	Main						; Иначе продолжаем опрос кнопок
;==============================================================================================
	end